<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><head>
<title>Scrotwm</title>
<meta name="Generator" content="Vim/7.2">
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1">
</head><body text="#ffffff" bgcolor="#101010">Benvenuti sul sito di Scrotwm.<p>
<small>
<a href="scrotwm.html">In English</a>
<a href="scrotwm_es.html">En Español</a>
<a href="scrotwm_ru.html">In Russian</a>
<p>
</small>
Scrotwm &egrave; un piccolo gestore di finestre tiling dinamico per X11.
Cerca di stare in disparte, in modo che il prezioso spazio sullo schermo
possa essere usato per cose pi&ugrave; importanti. Ha dei default sensati
e non costringe l'utente ad imparare un linguaggio di programmazione per
configurarlo. &Egrave; stato scritto dagli hacker per gli hacker e cerca di
essere piccolo, compatto e veloce.
</p><p>
&Egrave; stato ispirato in buona parte da
<a href="http://xmonad.org/">xmonad</a>
e
<a href="http://www.suckless.org/dwm/">dwm</a>.
Entrambi sono ottimi programmi ma soffrono di cose come:
sindrome&ndash;del&ndash;folle&ndash;linguaggio&ndash;non&ndash;portabile,
default insensati, layout asimmetrico delle finestre, "quanto potr&agrave;
mai essere difficile?" e buon vecchio NIQ.
Nonostante questo, dwm si &egrave; rivelata una risorsa fenomenale, e una
gran quantit&agrave; di buone idee e codice sono state prese in prestito
da l&igrave;.
Dalla sua parte xmonad ha degli ottimi default, scorciatoie da tastiera e
supporto a xinerama, ma &egrave; svantaggiato dal fatto di non essere
scritto in C.
</p><p>
Scrotwm &egrave; una meravigliosa perla!
Perch&eacute; anch'esso &egrave; stato creato da grande irritazione.
Non esistono perdite di tempo maggiori del dover spostare continuamente le
finestre finch&eacute; non sono pressapoco della dimensione giusta, o del
trovarsi con praticamente ogni combinazione di tasti sensata gi&agrave;
occupata da una qualche funzione che non torner&agrave; mai utile.
Questo percorso di agonia &egrave; troppo lungo da descrivere, quindi in
classico stile
<a href="http://www.openbsd.org/">OpenBSD</a>
(sopporta, oppure modifica) &egrave; stato creato un nuovo gestore di
finestre, che non ha altro scopo al di fuori dell'ubbidire ai propri maestri.
&Egrave; stato scritto da Marco Peereboom, Ryan Thomas McBride &amp; Darrin
Chandler ed &egrave; rilasciato secondo i termini della
<a href="license.html">licenza</a>
ISC.
Eventuali patch possono essere accettate a condizione che anche esse usino
la licenza ISC.<br>
</p><p>
Qui sotto ci sono alcuni screenshot di scrotwm in azione.
</p><center>
<a href="scrotwm.jpg"><img src="scrotwm_small.jpg" alt="[scrotwm]" border="0"></a><br>
Stack verticale.
<p>
<a href="scrotwm2.jpg"><img src="scrotwm2_small.jpg" alt="[scrotwm2]" border="0"></a><br>
Stack orizzontale.
</p><p>
<a href="scrotwm3.jpg"><img src="scrotwm3_small.jpg" alt="[scrotwm3]" border="0"></a><br>
Stack orizzontale con gvim &amp; Firefox.
</p><p>
<a href="scrotwm4.jpg"><img src="scrotwm4_small.jpg" alt="[scrotwm4]" border="0"></a><br>
Stack verticale con una finestra floating e una finestra in pi&ugrave;
nell'area principale.
</p><p>
<a href="scrotwm5.jpg"><img src="scrotwm5_small.jpg" alt="[scrotwm5]" border="0"></a><br>
Mplayer, ridimensionato e spostato.
</p></center>
<p>
 <font face="monospace">
Funzionalit&agrave; principali:<br>
- Supporto per xrandr &amp; xinerama (schermi multipli) dinamici<br>
- Spostamenti ovunque, su tutti gli schermi, sia usando la tastiera che il
mouse<br>
- Barra dello stato personalizzabile<br>
- File di configurazione comprensibile da un essere umano<br>
- Screenshots<br>
- Riavviabile senza perdere lo stato<br>
- Menu d'avvio veloce<br>
- Numerosi layout dello schermo possibili con poche semplici combinazioni
da tastiera<br>
- Le finestre possono essere aggiunte o rimosse dall'area principale<br>
- Le finestre possono essere spostate in qualsiasi area di lavoro o
all'interno di una regione<br>
- Area principale ridimensionabile<br>
- Spostare/ridimensionare le finestre floating<br>
- Trascina&ndash;per&ndash;rendere&ndash;floating<br>
- Regioni definibili dall'utente<br>
- Tasto modificatore e scorciatoie definibili dall'utente<br>
- "Quirk" definibili dall'utente<br>
- Combinazioni per lanciare applicazioni definibili dall'utente<br>
<br>
Non ancora implementate:<br>
- Aggiungere la possibilit&agrave; di cercare una finestra<br>
- Aggiungere la possibilit&agrave; di identificare una finestra<br>
- Passare da Xlib a <a href="http://xcb.freedesktop.org/">XCB</a><br>
- Fare s&igrave; che le finestre floating ricordino la propria posizione
quando lo schermo viene ridisegnato<br>
- Implementare un meccanismo di stacking delle finestre floading<br>
<br>
Bug conosciuti:<br>
- Nessuno, al momento.
</font></p><p>
Ci si pu&ograve; riferire alla
<a href="man_it.html">pagina di manuale</a>
per una spiegazione pi&ugrave; dettagliata.
</p><p>
&Egrave; possibile scaricare i sorgenti via CVS anonimo su:<br>
CVSROOT=anoncvs@anoncvs.freedaemon.com:/scrotwm<br>
In alternativa, si possono scaricare degli snapshot periodici
<a href="snapshot">qui</a>.<br>
</p><p>
Per iscriversi alla lista dei cambiamenti effettuati via CVS,
inviare una mail a
<a href="mailto:majordomo@freedaemon.com">majordomo@freedaemon.com</a>
e scrivere nel corpo della mail: subscribe scrotwm-changes.
</p><p>
Copyright (c) 2009 Marco Peereboom &lt;marco@peereboom.us&gt;,
Ryan Thomas McBride &lt;mcbride@countersiege.com&gt; &amp;
Darrin Chandler &lt;dwchandler@stilyagin.com&gt;<br>
</p><p>
Mirrors:<br>
<a href="http://www.scrotwm.org/">Main site</a><br>
<a href="http://www.scrotwm.com.ar/scrotwm.html">Argentinian mirror</a><br>
<a href="http://www.peereboom.us/scrotwm/html/scrotwm_old.html">American mirror</a><br>
<p>
<small>
$scrotwm$
</small></p></body></html>
